nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f83000evk/common/pin_mux/pin_mux.c
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MC56F83789
package_id: MC56F83789VLL
mcu_data: ksdk2_0
processor_version: 16.3.0
board: MC56F83000-EVK
pin_labels:
- {pin_num: '6', pin_signal: GPIOF8/RXD0/TB1/CMPD_O/PWMA_2X, label: USER_LED1, identifier: LED_RED;LEDRED}
- {pin_num: '68', pin_signal: GPIOE0/PWMA_0B/XB_OUT4, label: 'J3[13]/U3A[1]/GE0/PWMA_0B/LED0', identifier: PWM_LED0;LED0}
- {pin_num: '69', pin_signal: GPIOE1/PWMA_0A/XB_OUT5, label: 'J3[15]/U3B[3]/GE1/PWMA_0A/LED1', identifier: PWM_LED1;LED1}
- {pin_num: '74', pin_signal: GPIOE2/PWMA_1B/XB_OUT6, label: 'J3[9]/GE2/PWMA_1B', identifier: PWM_LED2;LED2}
- {pin_num: '75', pin_signal: GPIOE3/PWMA_1A/XB_OUT7, label: 'J3[11]/GE3/PWMA_1A', identifier: PWM_LED3;LED3}
- {pin_num: '82', pin_signal: GPIOE4/PWMA_2B/XB_IN2/XB_OUT8, label: 'J3[5]/GE4/PWMA_2B', identifier: PWM_LED4;LED4}
- {pin_num: '83', pin_signal: GPIOE5/PWMA_2A/XB_IN3/XB_OUT9, label: 'J3[7]/GE5/PWMA_2A', identifier: PWM_LED5;LED5}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitOSCPins();
    BOARD_InitDEBUG_UARTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitBUTTONsPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '94', peripheral: GPIOF, signal: 'GPIO, 6', pin_signal: GPIOF6/TB2/PWMA_3X/PWMB_3X/XB_IN2, direction: INPUT, gpio_interrupt: gpioIrqFallingEdge, slew_rate: slow,
    pull_enable: disable}
  - {pin_num: '77', peripheral: GPIOF, signal: 'GPIO, 1', pin_signal: GPIOF1/CLKO1/XB_IN7/CMPD_O, direction: INPUT, gpio_interrupt: gpioIrqFallingEdge, pull_enable: disable}
  - {pin_num: '46', peripheral: GPIOF, signal: 'GPIO, 15', pin_signal: GPIOF15/RXD0/XB_IN10, direction: INPUT, gpio_interrupt: gpioIrqFallingEdge, pull_enable: disable}
  - {pin_num: '12', peripheral: GPIOC, signal: 'GPIO, 4', pin_signal: GPIOC4/TA1/CMPB_O/XB_IN8/EWM_OUT_B, direction: INPUT, gpio_interrupt: gpioIrqFallingEdge, pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBUTTONsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBUTTONsPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* GPIO functionality on pin GPIOC4 (pin 12) */
    GPIO_PinSetPeripheralMode(BOARD_SW5_GPIO, BOARD_SW5_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF1 (pin 77) */
    GPIO_PinSetPeripheralMode(BOARD_SW3_GPIO, BOARD_SW3_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF6 (pin 94) */
    GPIO_PinSetPeripheralMode(BOARD_SW4_GPIO, BOARD_SW4_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF15 (pin 46) */
    GPIO_PinSetPeripheralMode(BOARD_SW2_GPIO, BOARD_SW2_PIN_MASK, kGPIO_ModeGpio);

    /* Initialize GPIO functionality on pin GPIOC4 (pin 12)  */
    GPIO_PinSetDirection(BOARD_SW5_GPIO, BOARD_SW5_PIN_MASK, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOF1 (pin 77)  */
    GPIO_PinSetDirection(BOARD_SW3_GPIO, BOARD_SW3_PIN_MASK, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOF6 (pin 94)  */
    GPIO_PinSetDirection(BOARD_SW4_GPIO, BOARD_SW4_PIN_MASK, kGPIO_DigitalInput);

    /* Initialize GPIO functionality on pin GPIOF15 (pin 46)  */
    GPIO_PinSetDirection(BOARD_SW2_GPIO, BOARD_SW2_PIN_MASK, kGPIO_DigitalInput);

    /* Pin configuration on GPIOF6 (pin 94) */
    /* Slew rate control configuration: Slow slew rate is configured */
    GPIO_PinSetSlewRate(BOARD_SW4_GPIO, BOARD_SW4_PIN_MASK, kGPIO_SlewRateSlow);

    /* Interrupt configuration on GPIOC4 (pin 12): Interrupt on falling edge */
    GPIO_PinSetInterruptConfig(BOARD_SW5_GPIO, BOARD_SW5_PIN_MASK, kGPIO_InterruptFallingEdge);

