nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f83000evk/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitOSCPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitOSCPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* Enable peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMode(BOARD_EXTAL_GPIO, BOARD_EXTAL_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC0 (pin 3) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C0_EXTAL);
    /* Enable peripheral functionality on pin GPIOC1 (pin 4) */
    GPIO_PinSetPeripheralMode(BOARD_XTAL_GPIO, BOARD_XTAL_PIN_MASK, kGPIO_ModePeripheral);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitTHERMISTORPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '17', peripheral: ADC, signal: 'ANA, 7', pin_signal: GPIOA7/ANA7}
  - {pin_num: '19', peripheral: ADC, signal: 'ANA, 6', pin_signal: GPIOA6/ANA6}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitTHERMISTORPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitTHERMISTORPins(void)
{
    /* GPIOA IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOA);
    /* Enable peripheral functionality on pin GPIOA6 (pin 19) */
    GPIO_PinSetPeripheralMode(BOARD_THER_A_GPIO, BOARD_THER_A_PIN_MASK, kGPIO_ModePeripheral);
    /* Enable peripheral functionality on pin GPIOA7 (pin 17) */
    GPIO_PinSetPeripheralMode(BOARD_THER_B_GPIO, BOARD_THER_B_PIN_MASK, kGPIO_ModePeripheral);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitUSBPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '90', peripheral: GPIOF, signal: 'GPIO, 13', pin_signal: GPIOF13/MOSI1/PWMB_FAULT1, direction: OUTPUT, gpio_init_state: 'false', open_drain: disable,
    pull_select: up}
  - {pin_num: '91', peripheral: GPIOF, signal: 'GPIO, 14', pin_signal: GPIOF14/SCLK1/PWMB_FAULT0, direction: OUTPUT}
  - {pin_num: '39', peripheral: USB, signal: DP, pin_signal: USB_DP}
  - {pin_num: '40', peripheral: USB, signal: DM, pin_signal: USB_DM}
  - {pin_num: '89', peripheral: GPIOF, signal: 'GPIO, 12', pin_signal: GPIOF12/MISO1/PWMB_FAULT2, direction: INPUT, pull_select: up, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitUSBPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitUSBPins(void)
{
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* GPIO functionality on pin GPIOF12 (pin 89) */
    GPIO_PinSetPeripheralMode(BOARD_USB_OTG_ID_GPIO, BOARD_USB_OTG_ID_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF13 (pin 90) */
    GPIO_PinSetPeripheralMode(BOARD_USB_PWR_GPIO, BOARD_USB_PWR_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF14 (pin 91) */
    GPIO_PinSetPeripheralMode(BOARD_USB_OC_GPIO, BOARD_USB_OC_PIN_MASK, kGPIO_ModeGpio);

    /* Initialize GPIO functionality on pin GPIOF12 (pin 89)  */
    GPIO_PinSetDirection(BOARD_USB_OTG_ID_GPIO, BOARD_USB_OTG_ID_PIN_MASK, kGPIO_DigitalInput);

    /* Pin configuration on GPIOF12 (pin 89) */
    /* Pull mode configuration: Internal pull-up resistor is enabled */
    GPIO_PinSetPullResistorMode(BOARD_USB_OTG_ID_GPIO, BOARD_USB_OTG_ID_PIN_MASK, kGPIO_PullUp);

    /* Pin configuration on GPIOF13 (pin 90) */
    /* Pull-Pull/Open drain output mode configuration: Push pull output mode */
    GPIO_PinSetOutputMode(BOARD_USB_PWR_GPIO, BOARD_USB_PWR_PIN_MASK, kGPIO_OutputPushPull);

    /* Initialize GPIO functionality on pin GPIOF13 (pin 90)  */
    GPIO_PinWrite(BOARD_USB_PWR_GPIO, BOARD_USB_PWR_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BOARD_USB_PWR_GPIO, BOARD_USB_PWR_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF14 (pin 91)  */
    GPIO_PinWrite(BOARD_USB_OC_GPIO, BOARD_USB_OC_PIN_MASK, kGPIO_OutputLow);
    GPIO_PinSetDirection(BOARD_USB_OC_GPIO, BOARD_USB_OC_PIN_MASK, kGPIO_DigitalOutput);

    GPIOF->PUS = ((GPIOF->PUS &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUS_PUS_13_MASK)))

                  /* Pull Resistor Type Select Bits: Pullup resistor. */
                  | GPIO_PUS_PUS(PUS_PUS_13_PULLUP));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSPI_FLASHPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '48', peripheral: QSPI1, signal: MOSI, pin_signal: GPIOG11/TB3/CLKO0/MOSI1}
  - {pin_num: '47', peripheral: QSPI1, signal: MISO, pin_signal: GPIOD7/XB_OUT11/XB_IN7/MISO1}
  - {pin_num: '55', peripheral: QSPI1, signal: SCLK, pin_signal: GPIOF0/XB_IN6/TB2/SCLK1}
  - {pin_num: '95', peripheral: QSPI1, signal: SS, pin_signal: GPIOF7/TB3/CMPC_O/SS1_B/XB_IN3}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

