nxp-mcuxpresso/mcuxsdk-examples/_boards/mc56f83000evk/common/pin_mux/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSPI_FLASHPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitSPI_FLASHPins(void)
{
    /* GPIOD IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOD);
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* GPIOG IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOG);
    /* Enable peripheral functionality on pin GPIOD7 (pin 47) */
    GPIO_PinSetPeripheralMode(BOARD_SPI_FLASH_MISO_GPIO, BOARD_SPI_FLASH_MISO_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOD7 (pin 47) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_D7_MISO1);
    /* Enable peripheral functionality on pin GPIOF0 (pin 55) */
    GPIO_PinSetPeripheralMode(BOARD_SPI_FLASH_SCLK_GPIO, BOARD_SPI_FLASH_SCLK_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF0 (pin 55) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F0_SCLK1);
    /* Enable peripheral functionality on pin GPIOF7 (pin 95) */
    GPIO_PinSetPeripheralMode(BOARD_SPI_FLASH_SS_GPIO, BOARD_SPI_FLASH_SS_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOF7 (pin 95) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_F7_SS1_B);
    /* Enable peripheral functionality on pin GPIOG11 (pin 48) */
    GPIO_PinSetPeripheralMode(BOARD_SPI_FLASH_MOSI_GPIO, BOARD_SPI_FLASH_MOSI_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOG11 (pin 48) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_G11_MOSI1);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitACCELPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '60', peripheral: GPIOF, signal: 'GPIO, 2', pin_signal: GPIOF2/SCL1/XB_OUT6/MISO1, direction: OUTPUT, gpio_init_state: 'true', open_drain: enable, pull_enable: enable}
  - {pin_num: '61', peripheral: GPIOF, signal: 'GPIO, 3', pin_signal: GPIOF3/SDA1/XB_OUT7/MOSI1, direction: INPUT, open_drain: enable, pull_enable: enable}
  - {pin_num: '6', peripheral: GPIOF, signal: 'GPIO, 8', pin_signal: GPIOF8/RXD0/TB1/CMPD_O/PWMA_2X, identifier: LEDRED, direction: OUTPUT, gpio_init_state: 'true'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitACCELPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitACCELPins(void)
{
    /* GPIOF IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOF);
    /* GPIO functionality on pin GPIOF2 (pin 60) */
    GPIO_PinSetPeripheralMode(BOARD_ACCEL_MAGNET_SCL_GPIO, BOARD_ACCEL_MAGNET_SCL_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF3 (pin 61) */
    GPIO_PinSetPeripheralMode(BOARD_ACCEL_MAGNET_SDA_GPIO, BOARD_ACCEL_MAGNET_SDA_PIN_MASK, kGPIO_ModeGpio);
    /* GPIO functionality on pin GPIOF8 (pin 6) */
    GPIO_PinSetPeripheralMode(BOARD_LEDRED_GPIO, BOARD_LEDRED_PIN_MASK, kGPIO_ModeGpio);

    /* Initialize GPIO functionality on pin GPIOF3 (pin 61)  */
    GPIO_PinSetDirection(BOARD_ACCEL_MAGNET_SDA_GPIO, BOARD_ACCEL_MAGNET_SDA_PIN_MASK, kGPIO_DigitalInput);

    /* Pin configuration on GPIOF2 (pin 60) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(BOARD_ACCEL_MAGNET_SCL_GPIO, BOARD_ACCEL_MAGNET_SCL_PIN_MASK, kGPIO_OutputOpenDrain);

    /* Pin configuration on GPIOF3 (pin 61) */
    /* Pull-Pull/Open drain output mode configuration: Open drain output mode */
    GPIO_PinSetOutputMode(BOARD_ACCEL_MAGNET_SDA_GPIO, BOARD_ACCEL_MAGNET_SDA_PIN_MASK, kGPIO_OutputOpenDrain);

    /* Initialize GPIO functionality on pin GPIOF2 (pin 60)  */
    GPIO_PinWrite(BOARD_ACCEL_MAGNET_SCL_GPIO, BOARD_ACCEL_MAGNET_SCL_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_ACCEL_MAGNET_SCL_GPIO, BOARD_ACCEL_MAGNET_SCL_PIN_MASK, kGPIO_DigitalOutput);

    /* Initialize GPIO functionality on pin GPIOF8 (pin 6)  */
    GPIO_PinWrite(BOARD_LEDRED_GPIO, BOARD_LEDRED_PIN_MASK, kGPIO_OutputHigh);
    GPIO_PinSetDirection(BOARD_LEDRED_GPIO, BOARD_LEDRED_PIN_MASK, kGPIO_DigitalOutput);

    GPIOF->PUR = ((GPIOF->PUR &
                   /* Mask bits to zero which are setting */
                   (~(GPIO_PUR_PU_2_MASK | GPIO_PUR_PU_3_MASK)))

                  /* Pull Resistor Enable Bits: Pull resistor is enabled. */
                  | GPIO_PUR_PU(PUR_PU_2_ENABLED)

                  /* Pull Resistor Enable Bits: Pull resistor is enabled. */
                  | GPIO_PUR_PU(PUR_PU_3_ENABLED));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCANPins:
- options: {callFromInitBoot: 'false', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '58', peripheral: CAN0, signal: TX, pin_signal: GPIOC11/CANTX/SCL1/TXD1, pull_enable: no_init}
  - {pin_num: '59', peripheral: CAN0, signal: RX, pin_signal: GPIOC12/CANRX/SDA1/RXD1, pull_enable: no_init}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCANPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCANPins(void)
{
    /* GPIOC IPBus Clock Enable: The peripheral is clocked. */
    CLOCK_EnableClock(kCLOCK_GPIOC);
    /* Enable peripheral functionality on pin GPIOC11 (pin 58) */
    GPIO_PinSetPeripheralMode(BOARD_CAN_TX_GPIO, BOARD_CAN_TX_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC11 (pin 58) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C11_CANTX);
    /* Enable peripheral functionality on pin GPIOC12 (pin 59) */
    GPIO_PinSetPeripheralMode(BOARD_CAN_RX_GPIO, BOARD_CAN_RX_PIN_MASK, kGPIO_ModePeripheral);
    /* Peripheral functionality on pin GPIOC12 (pin 59) */
    GPIO_PinSetPeripheralMux(kGPIO_Peri_C12_CANRX);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', prefix: BOARD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '9', peripheral: QSCI2, signal: TXD, pin_signal: GPIOD6/TXD2/XB_IN4/XB_OUT8}
  - {pin_num: '10', peripheral: QSCI2, signal: RXD, pin_signal: GPIOD5/RXD2/XB_IN5/XB_OUT9}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

